slides/2013-04-19-Elasticity.org
* Homework :slide:
  + Find price elasticity
  + Data in =code/price-elasticity.csv=
  + Your choice of solving technology

* Data :slide:
|DOW|Rooms|Rate|
|1|700|$216.79 |
|1|1020|$201.64 |
|1|1327|$136.60 |
|1|2087|$118.10 |
|1|757|$179.12 |
|1|90|$258.73 |
|1|1489|$136.37 |
|1|781|$165.35 |
|1|209|$287.84 |

* Data meanings :slide:
  + DOW: 1 == Sunday
  + Weekends are nights going into a weekend, ie Friday, Saturday, ie 6 & 7

* Result :slide:
  1. What is the price elasticity of weekday prices?
  1. What is the price elasticity of weekend prices?
  1. If we are currently forecast to be at 1000 rooms at $200 rate with 100
     available capacity, what price should we set to optimize max revenue for
     both
     + Weekday
     + Weekend

* Excel :slide:
#+begin_src Excel
LN()
Options > Add-Ins > Analysis ToolPak > Go > ToolPak
Data Analysis > Regression > Y Range, X Range
#+end_src

* Python :slide:
#+begin_src python
from math import log, exp
from scipy.stats import linregress
slope, intercept, r_value, p_value, std_err = linregress(indep, depend)
#+end_src

#+STYLE: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+STYLE: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
