slides/2013-04-19-Elasticity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2013-04-19-Elasticity</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2013-04-19-Elasticity"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-17 00:53:42 PDT"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2013-04-19-Elasticity</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Homework</a></li>
<li><a href="#sec-2">2 Data</a></li>
<li><a href="#sec-3">3 Data meanings</a></li>
<li><a href="#sec-4">4 Result</a></li>
<li><a href="#sec-5">5 Excel</a></li>
<li><a href="#sec-6">6 Python</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Homework &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Find price elasticity
</li>
<li>Data in <code>code/price-elasticity.csv</code>
</li>
<li>Your choice of solving technology
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Data &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="right" /><col class="right" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="right">DOW</td><td class="right">Rooms</td><td class="left">Rate</td></tr>
<tr><td class="right">1</td><td class="right">700</td><td class="left">$216.79</td></tr>
<tr><td class="right">1</td><td class="right">1020</td><td class="left">$201.64</td></tr>
<tr><td class="right">1</td><td class="right">1327</td><td class="left">$136.60</td></tr>
<tr><td class="right">1</td><td class="right">2087</td><td class="left">$118.10</td></tr>
<tr><td class="right">1</td><td class="right">757</td><td class="left">$179.12</td></tr>
<tr><td class="right">1</td><td class="right">90</td><td class="left">$258.73</td></tr>
<tr><td class="right">1</td><td class="right">1489</td><td class="left">$136.37</td></tr>
<tr><td class="right">1</td><td class="right">781</td><td class="left">$165.35</td></tr>
<tr><td class="right">1</td><td class="right">209</td><td class="left">$287.84</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Data meanings &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>DOW: 1 == Sunday
</li>
<li>Weekends are nights going into a weekend, ie Friday, Saturday, ie 6 &amp; 7
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Result &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>What is the price elasticity of weekday prices?
</li>
<li>What is the price elasticity of weekend prices?
</li>
<li>If we are currently forecast to be at 1000 rooms at $200 rate with 100
     available capacity, what price should we set to optimize max revenue for
     both
<ul>
<li>Weekday
</li>
<li>Weekend
</li>
</ul>

</li>
</ol>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Excel &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-Excel">LN()
Options &gt; Add-Ins &gt; Analysis ToolPak &gt; Go &gt; ToolPak
Data Analysis &gt; Regression &gt; Y Range, X Range
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Python &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">




<pre class="src src-python"><span style="color: #a020f0;">from</span> math <span style="color: #a020f0;">import</span> log, exp
<span style="color: #a020f0;">from</span> scipy.stats <span style="color: #a020f0;">import</span> linregress
slope, intercept, r_value, p_value, std_err = linregress(indep, depend)
</pre>



<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-17 00:53:42 PDT</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
